print("-------------------------------------------")
print("---- เกมส์ทายตัวเลขที่มีค่าอยู่ที่ 1 - 100 กันเถอะ ----")
print("-------------------------------------------")

answer = 59

while True:
    guess = int(input("ป้อนตัวเลขที่ต้องการทาย : "))
    if guess == answer:
        print("ยินดีด้วยคุณทายถูก")
        print("----------------------------------------------")
        break
    elif guess > answer:
        print("คุณทายผิดตัวเลขที่ป้อนมากไป")
    else:
        print("คุณทายผิดตัวเลขที่ป้อนน้อยไป")
    print("---------------------------------------------")