print('-------------------------------')
print("    โปรแกรมตรวจสอบสายรถเมล์       ")
print('-------------------------------')
bus_line = input("กรุณาป้อนสายรถเมล์: ")

if bus_line == "57":
    print("สาย 57 ไปปิ่นเกล้า บางขุนนนท์")
elif bus_line == "3":
    print("สาย 3 ไปสนามหลวง ลาดพร้าว")
elif bus_line == "71":
    print("สาย 71 ไปหัวลำโพง เยาวราช")
elif bus_line == "56":
    print("สาย 56 ไปบางลำพู สะพานกรุงธน")
elif bus_line == "539":
    print("สาย 539 ไปอนุสวรีย์ชัย สามเสน")
else:
    print("ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม")