#สร้างโปรแกรมคำนวณอายุของจากปีเกิด (พ.ศ.) ของพนักงานโรงงานแห่งหนึ่ง โดยป้อนชื่อและปีเกิดทางแป้นพิมพ์ ทั้งนี้โปรแกรมจะหยุดทำงานก็ต่อเมมื่อป้อนชื่อพนักงาน เป็น SAU ก็จะหยุดทำงาน
import datetime as datetime

print('-----------------------------')
print("โปรแกรมคำนวนอายุพนักงานโรงงาน")
print("-----------------------------")

while True : 
    emp_name = input('ชื่อพนังงาน : ')
    if emp_name.upper() == 'sau' :
        break
    emp_name = int(input('ปีเกิด (พ.ศ.) : '))
    emp_age = (datetime.now().year + 543) - emp_year
    print(f'คุณ {emp_name} มีอายุ {emp_age} ปี')
    print('-----------------------------')

print('-----------------------------')
print('ขอบคุณที่ใช้บริการ')  
print('-----------------------------')